{
  "basics": {
    "name": "Zhichao Zhu",
    "label": "Neural Computing Physicist",
    "image": "",
    "email": "zachary_zhu@outlook.com",
    "ORCID": "0009-0001-4490-8980",
    "summary": "I am a researcher focused on the theoretical foundations of intelligence in physical neural systems. My work investigates how representations, decisions, and learning emerge under constraints imposed by noise and energy, integrating perspectives from neuroscience, machine learning, and statistical physics.",
    "location": {
      "address": "No. 825, Zhangheng Road, Zhangjiang High Tech Park, Pudong New Area",
      "postalCode": "200433",
      "city": "Shanghai",
      "countryCode": "CN",
      "region": "Shanghai"
    }
  },

    "work": [
    { "position": "Post Doctoral Researcher",
      "name": "Institute of Science and Technology for Brain-Inspired Intelligence, Fudan University",
      "startDate": "2025-01-01",
      "endDate": "2026-12-31"
    }
  ],
  "education": [
    {
      "institution": "Fudan University, Shanghai, China",
      "location": "Shanghai, China",
      "url": "https://istbi.fudan.edu.cn/",
      "area": "Applied Mathematics",
      "studyType": "PhD",
      "startDate": "2020-09-01",
      "endDate": "2024-12-30",
      "thesis": "On probabilistic computation in spiking neural networks:  a moment-based paradigm"
    },
    {
      "institution": "University of Warwick, Coventry, UK",
      "location": "Coventry, UK",
      "url": "https://warwick.ac.uk/",
      "area": "Computer Science",
      "studyType": "MSc",
      "startDate": "2018-10-01",
      "endDate": "2019-10-01",
      "score": "Distinction",
      "courses": ["Computational Biology", "Data Mining", "Natural Language Processing"]
    },
    {
      "institution": "Northwestern Polytechnical University, Xi'an, China",
      "location": "Xi'an, China",
      "url": "https://en.nwpu.edu.cn/",
      "area": "Environmental Engineering",
      "studyType": "BSc",
      "startDate": "2011-09-01",
      "endDate": "2015-07-01"
    }
  ],
  "publications": [
    {
      "name": "Learning and Inference with Correlated Neural Variability",
      "publisher": "PNAS Nexus",
      "releaseDate": "2025-10-10",
      "url": "https://doi.org/10.1093/pnasnexus/pgaf284",
      "summary": "We developed a new kind of neural network known as the moment neural network (MNN), which depicts how the mean firing rate and the noise correlation of spiking neurons propogate through the network. We show that the MNN can be used to approximate the dynamics of a spiking neural network (SNN) with a high degree of accuracy. As a result, the MNN is a promising theorectical tool to understand how SNN perform probabilistic computing."
    },
    {
      "name": "Learning to integrate parts for whole through correlated neural variability",
      "publisher": "PLOS Computational Biology",
      "releaseDate": "2024-09-03",
      "url": "https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1012401",
      "summary": "For historical reasons, the mean firing rate is throught to be the parimary information carrier in the brain. However, recent studies have shown that the correlated neural variability, which is the trial-to-trial fluctuations in the neural responses, can also carry information. We demonstrated that the correlated neural variability can be used to integrate parts for whole, which is a fundamental computation in the brain."
    },
    {
      "name": "Toward a Free-Response Paradigm of Decision-Making in Spiking Neural Networks",
      "publisher": "Neural Computation",
      "releaseDate": "2025-01-09",
      "url": "https://direct.mit.edu/neco/article/doi/10.1162/neco_a_01733/127433",
      "summary": "Speed-Accraucy Trade-Off (SAT) is a fundamental property of decision-making in the brain, where the reaction time reflect an agent's uncertainty about the decision. We explained the SAT in the context of spiking neural networks with the help of MNN, and showed that an SNN learning to shape its decision confidence leads to shorter reaction time. By setting a reasonable stopping policy, the SNN can achieve the same performance with much shorter latency in average."
    },
    {
      "name": "Stochastic Forward-Forward Learning through Representational Dimensionality Compression",
      "publisher": "NeurIPS",
      "releaseDate": "2025-11-15",
      "url": "https://openreview.net/forum?id=RWkLsoLeuj&noteId=RWkLsoLeuj",
      "summary": "The Forward-Forward (FF) algorithm is a biologically plausible alternative to backpropagation (BP) for training neural networks. However, existing goodness functions used in FF neglect the correlated variability between neurons. We proposed a novel goodness function based on dimensionality compression that incorporates second-order statistical structure. Our approach promotes structured representations without the need for negative samples and achieves competitive performance compared to other non-BP methods."
    }
  ],
    "projects": [
    {
      "name": "Moment Neural Network (MNN)",
      "summary": "MNN is a new class of deep learning architecture which naturally generalizes rate-based neural networks to second order statistical moments. Once trained, the parameters of the MNN can be directly used to recover the corresponding SNN without further fine-tuning. The trained model captures realistic firing statistics of biological neurons including broadly distributed firing rates and Fano factors as well as weak pairwise correlation.",
      "highlights": ["Brain-inspired Intelligence", "Neural Coding", "Probabilistic Computing", "Noise Correlation"],
      "startDate": "2020-09-01",
      "endDate": "Today",
      "url": "https://github.com/ZhichaoZhu/moment-neural-network"
    }
  ],

  "languages": [
    {
      "language": "Chinese",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "interests": [
    {
      "name": "Physics",
      "icon": "fa-solid fa-tag",
      "keywords": [
        "Statistical Physics",
        "Thermodynamics",
        "Complex Systems"
      ]
    },
    {
      "name": "Computer Science",
      "icon": "fa-solid fa-laptop",
      "keywords": [
        "Brain-inspired Intelligence",
        "Information theory",
        "Theoretical Computer Science"
      ]
    },
    {
      "name": "Computational Neuroscience",
      "icon": "fa-solid fa-brain",
      "keywords": [
        "Neural Coding",
        "Predictive Coding"
      ]
    }
  ],
  "references": [
    {
      "name": "Professor Jianfeng Feng",
      "icon": "fa-solid fa-thumbtack"
    },
    {
      "name": "Professor Wenlian Lu",
      "icon": "fa-solid fa-thumbtack"
    },
    {
      "name": "Dr. Yang Qi",
      "icon": "fa-solid fa-thumbtack"
    }
  ]
}
